tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh.*"
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DIC;
        maxIter          100;
    }

    "(U|h|e|k|epsilon).*"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0.1;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        "rho.*"         1;
        "p_rgh.*"       0.7;
    }
    equations
    {
        "U.*"           0.3;
        "(h|e).*"       0.3;
        "k.*"           0.3;
        "epsilon.*"     0.3;
    }
}


// ************************************************************************* //
